module.exports = {
    vozm: '🔥 Готов к взрыву возможностей? Я твой личный AI-помощник! \n' +
        '\n' +
        '1️⃣ Составлю резюме, которое заставит работодателей биться за тебя, как фанаты за автограф Брэда Питта.\n' +
        '2️⃣ Напишу текст на любую тему. Нужен роман в стиле Достоевского или статья о квантовой физике? Расслабься, я справлюсь.\n' +
        '3️⃣ Переведу текст с любого языка. Даже если это древнеегипетские иероглифы (шутка, с иероглифами я пока не дружу).\n' +
        '4️⃣ Ответлю на вопросы. Я как Google, только с чувством юмора.\n' +
        '5️⃣ Напишу код, переведу его с одного языка на другой и найду ошибки. Я как твой личный баг-бастер.\n' +
        '6️⃣ Помогу с планированием и расчетами. Хочешь план питания для похудения? Подожди минутку, пока я не приготовлю тебе виртуальный салат.\n' +
        '\n' +
        '💡 Это только вершина айсберга моих возможностей. Задай мне любую задачу, и я постараюсь тебе помочь.\n' +
        '\n' +
        '👇🏻 Нажми кнопку «Начать чат» 👇🏻\n',

    surp: '🎁 Пригласи друга и получи +1 день подписки БЕСПЛАТНО!\n' +
        '(Скопируйте Вашу реферальную ссылку и отправьте другу)\n' +
        '\n' +
        'Приглашено: 0\n' +
        '\n' +
        'Реферальная ссылка:\n' +
        '〰️〰️〰️\n' +
        'https://t.me/#`'
}